# Task 1.1
# for Loop and while loop
# 🔥
# 🔥🔥
# 🔥🔥🔥
# 🔥🔥🔥🔥
# 🔥🔥🔥🔥🔥


# while-loop............................................................
# fire=1
# while(fire<=5):
#     print("🔥"*fire)
#     fire+=1

# #  for-loop................................................................
# for fire in range(1,6):
#     print("🔥"*fire)



# Task  1.1 - With function

def emoji(a,emojie="🔥"):
    for i in range(0,a+1):
        print (f"{emojie}"*i)




(emoji(2, "🍓"))
(emoji(6, "🍍"))
(emoji(4, "🥕"))
(emoji(3))

# 🍓
# 🍓🍓
# 🍍
# 🍍🍍
# 🍍🍍🍍
# 🍍🍍🍍🍍
# 🍍🍍🍍🍍🍍
# 🍍🍍🍍🍍🍍🍍
# 🥕
# 🥕🥕
# 🥕🥕🥕
# 🥕🥕🥕🥕
# 🔥
# 🔥🔥
# 🔥🔥🔥